
# 消息处理超时重试次数(0为不重试, 负数为取消消息默认处理, 不建议)
retry_times = 1

message_drop_message = "【检测到时空信号交集, 当前消息被忽略, 请等待返回信号处理完成】"


# 禁用列表
# person为个人, 其中的QQ号会被禁止与机器人进行私聊或群聊交互
# 示例: person = [2854196310, 1234567890, 9876543210]
# group为群组, 其中的群号会被禁止与机器人进行交互
# 示例: group = [123456789, 987654321, 1234567890]

# 2854196310是Q群管家机器人的QQ号, 默认屏蔽以免出现循环
banned_person_list = [2854196310, 3353064953]

# 屏蔽的群号
banned_group_list = []

# 是否响应群消息(默认False不响应, 群聊更容易被风控)
quote_qq_group = False

# 仅在quote_qq_group为True时有效
# 群内响应规则, 符合此消息的群内消息即使不包含at机器人也会响应
# 支持消息前缀匹配及正则表达式匹配
# 注意每个规则的优先级为: 消息前缀 > 正则表达式 > 随机响应
# 字典允许缺失字段, 自动补充为空
# 正则表达式简明教程: https://www.runoob.com/regexp/regexp-tutorial.html
response_rules = {
    "default": {  # 默认, 若未特殊标注则引用此处规则
        "at": False,  # 是否响应at机器人的消息, ps: 就是群聊艾特会不会回, 如果为False则不回
        "prefix": [],
        "regexp": [],
        "random_rate": 0.0,  # 随机响应概率, 取值范围 0.0-1.0     0.0为完全不随机响应  1.0响应所有消息, 仅在前几项判断不通过时生效
    },
    "104960075": {  # 测试群
        "at": True,
        "prefix": ["/", "!", "！", "ai"],
        "regexp": ["怎么?样.*", "怎么.*", "如何.*", ".*咋办"],
        "random_rate": 0.0,
    },
}
